---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.BottomOfPartElevation
source: html/0c8d296a-f7e8-9e8b-f0c2-43e03a9081d4.htm
---
# Autodesk.Revit.DB.FabricationPart.BottomOfPartElevation Property

The associated elevation to the bottom of fabrication part off of the current level.

## Syntax (C#)
```csharp
public double BottomOfPartElevation { get; }
```